results/run013/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;

/*
    Main methods are:
    1) Geometric: "simple"; "hierarchical", with ordered sorting, e.g. xyz, yxz
    2) Scotch: "scotch", when running in serial; "ptscotch", running in parallel
*/

method              scotch;

simpleCoeffs
{
    n               (1 4 1); // total must match numberOfSubdomains
}

hierarchicalCoeffs
{
    n               (1 4 1); // total must match numberOfSubdomains
    order           yxz;
}


// ************************************************************************* //
